### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [74]:
# Dependencies and Setup
import pandas as pd
import numpy as np
# load file
file = ("resources/purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [75]:
#change column names
purchase_data.rename(columns = {'Purchase ID':'purchase_ID', 'Item ID':'Item_ID', 'Item Name': 'Item_Name'},inplace=True)
purchase_data.head()

,purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [76]:
#count players
player_count = purchase_data.groupby("SN")["SN"].nunique().count()
print(f"Total Players: {player_count}")

Total Players: 576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [112]:
#Count unique items
unique_items = purchase_data['Item_Name'].nunique()
unique_items

179

In [78]:
#Find the Average Price
avg_price = purchase_data['Price'].mean()
avg_price

3.050987179487176

In [79]:
#Find total number of sales
total_sales = purchase_data['purchase_ID'].count()
total_sales

780

In [80]:
#find the total revenue
total_rev = purchase_data['Price'].sum()
total_rev

2379.77

In [81]:
#create a summary to display findings
summary = pd.DataFrame([[player_count, unique_items, avg_price, total_sales, total_rev]], columns=['Total_Gamers', 'Unique Item Count', 'Average_Price', 'Count_of_Purchases', 'Current_Revenue'])
summary

,Total_Gamers,Unique Item Count,Average_Price,Count_of_Purchases,Current_Revenue
0,576,179,3.050987,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [82]:
#find count of players per gender
gender_group = purchase_data.groupby("Gender")['SN'].nunique()
gender_group

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [83]:
# convert the count to percentages
genders_percentage = ((gender_group*100)/player_count)
genders_percentage

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [84]:
#Create a summary to display gender data
gender_summary = pd.concat([gender_group, genders_percentage], axis=1)
gender_summary.reset_index(inplace=True)
gender_summary

                  Gender   SN         SN
0                 Female   81  14.062500
1                   Male  484  84.027778
2  Other / Non-Disclosed   11   1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [85]:
#get purchase count by gender
gender_purchase = purchase_data.groupby('Gender')['purchase_ID'].count()
gender_purchase

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: purchase_ID, dtype: int64

In [86]:
#find avg price by gender
gender_avg_price = purchase_data.groupby('Gender')['Price'].mean()
gender_avg_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [87]:
#total price by gender
price_total_gender = purchase_data.groupby('Gender')['Price'].sum()
price_total_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [88]:
#create gender_purchase_summary
gender_purchase_summary = pd.concat([gender_purchase, gender_avg_price, price_total_gender], axis=1)
gender_purchase_summary.reset_index(inplace=True)
gender_purchase_summary

                  Gender  purchase_ID     Price    Price
0                 Female          113  3.203009   361.94
1                   Male          652  3.017853  1967.64
2  Other / Non-Disclosed           15  3.346000    50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [89]:
#Create Bins
age_oldest = purchase_data[purchase_data['Age'] == purchase_data['Age'].max()]
#age_oldest: 45
age_youngest = purchase_data[purchase_data['Age'] == purchase_data['Age'].min()]
#age_youngest: 7
bins = [0,10,15,20,25,30,35,40,45]
labels = ['5 - 10', '11 - 15', '16 - 20', '21 - 25', '26 - 30', '31 - 35', '36 - 40', '41 - 45']
purchase_data_binned = purchase_data.groupby(pd.cut(purchase_data['Age'], bins = bins, labels = labels)).nunique()
#purchase_data_binned

In [90]:
#get number and %
age_percentage = (purchase_data_binned["SN"]/player_count)*100
#age_percentage
age_count = purchase_data_binned["SN"]
#age_count

In [91]:
age_summary = pd.concat([age_percentage, age_count], axis=1)
age_summary.reset_index(inplace=True)
age_summary

       Age         SN   SN
0   5 - 10   4.166667   24
1  11 - 15   7.118056   41
2  16 - 20  26.041667  150
3  21 - 25  40.277778  232
4  26 - 30  10.243056   59
5  31 - 35   6.423611   37
6  36 - 40   4.513889   26
7  41 - 45   1.215278    7

# Purchasing Analysis (Age)

# * Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [92]:
# purchase count by age
purchasecount = purchase_data_binned['purchase_ID']
purchasecount

Age
5 - 10      32
11 - 15     54
16 - 20    200
21 - 25    325
26 - 30     77
31 - 35     52
36 - 40     33
41 - 45      7
Name: purchase_ID, dtype: int64

In [93]:
#purchase value
# set bins (use same as above)
purchase_value_age = purchase_data.groupby(pd.cut(purchase_data["Age"], bins = bins, labels = labels)).sum()
#pd.cut for age and bins in purchase_data
purchase_value_age = purchase_value_age['Price']
purchase_value_age

Age
5 - 10     108.96
11 - 15    156.60
16 - 20    621.56
21 - 25    981.64
26 - 30    221.42
31 - 35    155.71
36 - 40    112.35
41 - 45     21.53
Name: Price, dtype: float64

In [94]:
#purchase_avg by age
purchase_avg_age = purchase_data.groupby(pd.cut(purchase_data['Age'], bins=bins, labels=labels)).mean()
purchase_avg_age = purchase_avg_age['Price']
purchase_avg_age

Age
5 - 10     3.405000
11 - 15    2.900000
16 - 20    3.107800
21 - 25    3.020431
26 - 30    2.875584
31 - 35    2.994423
36 - 40    3.404545
41 - 45    3.075714
Name: Price, dtype: float64

In [95]:
#average purchase total per person
total_perperson_age = purchase_value_age/purchasecount
total_perperson_age

Age
5 - 10     3.405000
11 - 15    2.900000
16 - 20    3.107800
21 - 25    3.020431
26 - 30    2.875584
31 - 35    2.994423
36 - 40    3.404545
41 - 45    3.075714
dtype: float64

In [96]:
purchases_age_summary = pd.concat([purchasecount, purchase_value_age, purchase_avg_age, total_perperson_age], axis=1)
purchases_age_summary.head()

         purchase_ID   Price     Price         0
Age
5 - 10            32  108.96  3.405000  3.405000
11 - 15           54  156.60  2.900000  2.900000
16 - 20          200  621.56  3.107800  3.107800
21 - 25          325  981.64  3.020431  3.020431
26 - 30           77  221.42  2.875584  2.875584

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [97]:
playerPurchases=purchase_data.groupby('SN')['purchase_ID'].count()
playerPurchases

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: purchase_ID, Length: 576, dtype: int64

In [98]:
total_spent = purchase_data.groupby('SN')['Price'].sum()
total_spent.rename(axis={'Price':'Avg_Price_TS'}, inplace=True)
total_spent

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Length: 576, dtype: float64

In [99]:
Avg_price = purchase_data.groupby("SN")['Price'].mean()
Avg_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [131]:
TopSpender_summary = pd.concat([playerPurchases, AvgpriceTS, total_spent], axis=1)
TopSpender_summary.reset_index(inplace=True)
TopSpender_summary.rename(columns={'SN':'Player_ID', 0:'Total_Spent'}, inplace=True)
TopSpender_summary_sort = TopSpender_summary.sort_values('Total_Spent', ascending=False)
TopSpender_summary_sort.head()

       Player_ID  purchase_ID     Price  Total_Spent
360    Lisosia93            5  3.792000        18.96
246  Idastidru52            4  3.862500        15.45
106   Chamjask73            3  4.610000        13.83
275       Iral74            4  3.405000        13.62
281  Iskadarya95            3  4.366667        13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [105]:
purchase_data.head()

,purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [143]:
total_purchases= purchase_data.groupby('Item_Name')['purchase_ID'].count()
total_purchases.head()

Item_Name
Abyssal Shard                     5
Aetherius, Boon of the Blessed    5
Agatha                            6
Alpha                             3
Alpha, Oath of Zeal               3
Name: purchase_ID, dtype: int64

In [127]:
topItemPrice = purchase_data.groupby('Item_Name')['Price'].mean()
topItemPrice.head()

Item_Name
Abyssal Shard                     2.67
Aetherius, Boon of the Blessed    3.39
Agatha                            3.08
Alpha                             2.07
Alpha, Oath of Zeal               4.05
Name: Price, dtype: float64

In [132]:
topTotalRev = purchase_data.groupby('Item_Name')["Price"].sum()
topTotalRev.rename(axis={'Price': 'Total_Rev'}, inplace=True)
topTotalRev.head()

Item_Name
Abyssal Shard                     13.35
Aetherius, Boon of the Blessed    16.95
Agatha                            18.48
Alpha                              6.21
Alpha, Oath of Zeal               12.15
dtype: float64

In [146]:
MostPopular_summary = pd.concat([total_purchases, topItemPrice, topTotalRev], axis=1)
MostPopular_summary.reset_index(inplace=True)
MostPopular_summary.rename(columns={'purhcase_ID':'Purchase_Count', 0:'Total_Rev'}, inplace=True)
MostPopular_summary_sort = MostPopular_summary.sort_values('Total_Rev', ascending=False).head()
MostPopular_summary_sort

,Item_Name,purchase_ID,Price,Total_Rev
56,Final Critic,13,4.614615,59.99
93,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
92,Nirvana,9,4.900000,44.10
55,Fiery Glass Crusader,9,4.580000,41.22
125,Singed Scalpel,8,4.350000,34.80

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame